app/Containers/ShopSection/CartItem/Actions/GenerateNewCartItemAction.php

insert into `cart_items` (`product_id`, `quantity`, `category_name`, `product_name`, `sale`, `subtotal_amount`, `amount`, `cart_id`) values (4, 1, 'Продукты', 'Банан', 0, 10000, 10000, 2)
---
    public function run(Product $product): CartItem
    {

        $cartItem = new CartItem();
        $cartItem->setProductId($product->getKey());
        $cartItem->setQuantity(1);
        $cartItem->setCategoryName($product->getCategory()->getName());
        $cartItem->setProductName($product->getName());
        $cartItem->setSale($product->getSale()); // скидка (-100 рублей)

        $cartItem->setSubtotalAmount($product->getPrice()); //цена без скидки
        //dd($product->getSale(), $product->getPriceWithDiscount(), $product->getPrice());
        //итоговая цена
        $cartItem->setAmount($product->getSale() === null ? $product->getPrice() : $product->getPrice() - $product->getSale());
        $cartItem->setCartId(app()['cart']->getCartId());
        $cartItem->save();