app/Containers/ShopSection/CartItem/Data/Repositories/CartItemRepository.php

    public function getProductQuantyById(int $cartItemId): int {
        return CartItem::where('id',$cartItemId)->with('product')->first()->getProduct()->getQuantity();
---
select * from `cart_items` where `id` = 64 and `cart_items`.`deleted_at` is null limit 1
select * from `products` where `products`.`id` in (3) and `products`.`deleted_at` is null

    public function getListByCart(Cart $cart, array $columns = ['*'], array $with = []): Collection
    {
        return $cart->cartItems()->select($columns)->with($with)->get();
---
select * from `cart_items` where `cart_items`.`cart_id` = 2 and `cart_items`.`cart_id` is not null and `cart_items`.`deleted_at` is null