app/Containers/ShopSection/Cart/Actions/AddCouponAction.php

select * from `coupons` where `name` = 'Купон391' limit 1
---
    public function run(Cart $cart, string $couponName)
    {
        $coupon = Coupon::where('name', $couponName)->first();