app/Containers/ShopSection/Cart/Actions/RecalculateCartAction.php

update `cart_items` set `sale` = 4200 where `id` = 65
---
            }
            $sale += $quantity * $item->getSale();
            $subtotal += $quantity * $item->getSubtotalAmount();
            $item->save();

update `carts` set `subtotal_amount` = 50000, `total_amount` = 29100, `total_sale` = 20900 where `id` = 2
---
        $cart->setTotalSale($sale); //сумма скидки
        $cart->setTotalAmount($subtotal - $sale); //общая цена корзины
//        dd($subtotal,$sale, $subtotal - $sale);
        $cart->save();