app/Containers/ShopSection/Cart/Actions/RemoveCartItemAction.php

    public function run(int $cartItemId, Cart $cart)
    {
        $cartItem = $cart
            ->cartItems()
            ->where('id', $cartItemId)
            ->first();


        $cartItem->delete();
---
select * from `cart_items` where `cart_items`.`cart_id` = 2 and `cart_items`.`cart_id` is not null and `id` = 62 and `cart_items`.`deleted_at` is null limit 1
update `cart_items` set `deleted_at` = '2022-09-06 11:41:20' where `id` = 62