app/Containers/ShopSection/Cart/Actions/RemoveCouponAction.php

select * from `coupons` where `name` = 'Купон250' limit 1
---
    public function run(Cart $cart, string $couponName){

        $coupon = Coupon::where('name', $couponName)->first();