app/Containers/ShopSection/Cart/Utilities/Manager.php

select count(*) as aggregate from `carts` where exists (select * from `cart_items` where `carts`.`id` = `cart_items`.`cart_id` and `product_id` = 4 and `cart_id` = 2 and `cart_items`.`deleted_at` is null)
---
    public function checkInCart(int $productId): bool
    { //если есть - тру, нету - фолс
        $cart = $this->getCart();
        $cartId = $cart->getKey();

//        $cart->loadCount('cartItems.purchaseItemDetail', function (Builder $query) use ($productId) {
//            return $query->where('product_id', $productId);
//        });
        $result = $cart
                ->whereHas('cartItems', function (Builder $query) use ($productId, $cartId) {
                    return $query->where('product_id', $productId)->where('cart_id', $cartId);
                })
                ->count() > 0;

select sum(`quantity`) as aggregate from `cart_items` where `cart_items`.`cart_id` = 2 and `cart_items`.`cart_id` is not null and `cart_items`.`deleted_at` is null
---
    public function getQuantity(): int
    {
        return $this->getCart()->cartItems()->sum('quantity');