app/Http/Controllers/Shop/CatalogController.php

    public function index(Request $request)
    {
        SEOMeta::setTitle('Каталог');
        $frd = $request->all();
        $categories = Category::pluck('name', 'id');
        $products = Product::query()
            ->withCount(['cartItems as count_in_cart' => function (Builder $query) {
                $query->where('cart_id', app()['cart']->getCart()->getKey());
            }])
            ->with(['category'])
            ->filter($frd)
            ->paginate(12);
---
select `name`, `id` from `categories`
select * from `categories` where `categories`.`id` in (1, 2, 3)
select count(*) as aggregate from `products` where `products`.`deleted_at` is null