app/Http/Controllers/Shop/CouponController.php

select * from `coupons` limit 12 offset 0
select count(*) as aggregate from `coupons`
---
    public function index(Request $request)
    {
        $frd = $request->all();
        $coupons = Coupon::filter($frd)->paginate(12);

select `name`, `id` from `coupons_types`
select `name`, `id` from `coupons_value_types`
---
    public function create()
    {
        $couponTypes = CouponsType::pluck('name','id');
        $couponValueTypes = CouponsValueType::pluck('name','id');

select `name`, `id` from `coupons_types`
select `name`, `id` from `coupons_value_types`
---
    public function edit(Coupon $coupon)
    {
        $couponTypes = CouponsType::pluck('name','id');
        $couponValueTypes = CouponsValueType::pluck('name','id');

delete from `coupons` where `id` = 3
---
    public function destroy(Coupon $coupon)
    {
        $coupon->delete();