app/Http/Controllers/ProductController.php

    public function index(Request $request)
    {
        SEOMeta::setTitle('Товары');
        $frd = $request->all();
        $categories = Category::pluck('name', 'id');
        $products = Product::query()
            ->with(['category'])
            ->filter($frd)
            ->paginate(12);
---
select `name`, `id` from `categories`
select * from `categories` where `categories`.`id` in (1, 2, 3)
select * from `products` where `products`.`deleted_at` is null limit 12 offset 0
select count(*) as aggregate from `products` where `products`.`deleted_at` is null

    public function create()
    {
        $categories = Category::select('name', 'id')->get();
---
select `name`, `id` from `categories`

    public function edit(Product $product)
    {
        SEOMeta::setTitle('Редактирование - ' . $product->getName());
        $categories = Category::select('name', 'id')->get();
---
select `name`, `id` from `categories`