app/Http/Controllers/UsersController.php

    public function __construct()
    {
        $genders = Gender::pluck('short_name', 'id')->toArray();
---
select `short_name`, `id` from `genders`

    public function index(Request $request)
    {
        SEOMeta::setTitle('Пользователи');

        $frd = $request->all();

        $users = User::query()
            ->with([
                'gender'
            ])
            ->filter($frd)
            ->filterHide()
            ->orderByDesc('id')
            ->paginate(25);
---
select * from `genders` where `genders`.`id` in (1, 2)
select * from `users` where `hide` = 0 order by `id` desc limit 25 offset 0
select count(*) as aggregate from `users` where `hide` = 0