app/Containers/ShopSection/Product/Data/Repositories/ProductItemRepository.php

    public function getListById(string $productId, array $columns = ['*'], array $with = []): Product
    {
        return Product::where('id',$productId)->select($columns)->with($with)->first();
---
select * from `products` where `id` = '4' and `products`.`deleted_at` is null limit 1